
const init = ()  => {
   
    createAllProducts();
    AOS.init();
    // revewseMatod();
}

const createAllProducts = () =>{

   let prod1 = new product("#ohuDoo","אבחנת הבד ",".1","/peulot/p1.jpg","נבחן את סוג הסלון , נבחן את ההרכב מבד שהוא עשוי ובהתאם לכך נתאים לו את חומרים המתאימים ביותר.");
   prod1.render();
   let prod2 =new product("#ohuDoo","ריסוס",".2","/peulot/p2.jpg","נרסס את הסלון בצורה אחידה בחומר ניקוי המהול במים בתערובת שהכנו המתאימה לסוג הבד שהבחנו.")
   prod2.render();
   let prod3 =new product("#ohuDoo","השריה",".3","/peulot/p3.jpg","נמתין בין 10-20 דקות להמסת הכתמים והשומנים, ברגע שנראה כיצד הלכלוך והשומן צף למעלה, הספה תהיה מוכנה לשלם הבא.")
   prod3.render();
   let prod4 =new product("#ohuDoo","הברשה",".4","/peulot/p4.jpg","נקרצף את הבד להמסת הכתמים הקשים שלא פורקו בשלב הקודם. החדרת החומר עמוק לסיבי הבד.")
   prod4.render();
   let prod5 =new product("#ohuDoo","הזרקה ויניקה",".5","/peulot/p5.jpg","נזריק מים בלחץ קיטור, עוצמת המים חודרת עמוק לסיבי הבד. שוטפת את הלכלוך שנוצר ובו זמנית על ידי יניקה עוצמתית שואבת את המים יחד עם הלכלוך והחומרים")
   prod5.render();
   let prod6 =new product("#ohuDoo","בישום",".6","/peulot/p6.jpg","לאחר שהסלון מבד נקי מכתמים , חומרים ולכלוך. אנו נרסס את הבד עם חומר בישום מיוחד אשר מעניק ניחוח מרענן של ספה חדשה . ")
   prod6.render();
   let prod7 =new product("#ohuDoo","חיטוי",".7","/peulot/p7.jpg","בשלב זה נחמם את המים הנקיים עד 90 מעלות חום, ונוסיף חומר שטיפה ייעודי המתאים לבד שהבחנו. עבודה בקיטור מבטיחה חיטוי והשמדת בקטריות, קרדית אבק הבית ומזיקים אחרים.")
   prod7.render();
   let prod8 =new product("#ohuDoo","ייבוש","8","/peulot/p8.jpg","בסיום כל הפעולות האלה ניתן לסלון מבד להתייבש לחלוטין . ומיד שתייבש תקבלו ספה ממש כמו חדשה. תיהנו!")
   prod8.render();
   let prod9 =new product("#ohuDoo","ניקיון אזור העבודה",".9","/peulot/p9.jpg","בסיום העבודה ננקה את כל סביבת העבודה כדי שאנחנו נצא מהבית שהכל נקי")
   prod9.render();
   




}

// const revewseMatod = () =>{

//     let prodooct1 = new product("#revewse","ניקול","נריה עשה עבודה מעולה חש על כלמ פרט ופרט לא דיבר הרבה אבל עשה המון ממליצה בחום","21/31/2020");
//     prodooct1.render();
//     let prodooct2 = new product("#revewse","ניקול","נריה עשה עבודה מעולה חש על כלמ פרט ופרט לא דיבר הרבה אבל עשה המון ממליצה בחום","21/31/2020");
//     prodooct2.render();
//     let prodooct3 = new product("#revewse","ניקול","נריה עשה עבודה מעולה חש על כלמ פרט ופרט לא דיבר הרבה אבל עשה המון ממליצה בחום","21/31/2020");
//     prodooct3.render();
// }


init();


